src/InformationRegisters/СостояниеПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПриложения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/Миграции/Ext/Module.bsl
// Версия данных и последовательные миграции (ARCHITECTURE §18).
// Состояние хранится в регистре сведений СостояниеПриложения.

#Область ПрограммныйИнтерфейс

// Приводит данные к версии, которую ожидает текущая конфигурация.
// Вызывается при каждом запуске приложения. Каждая миграция выполняется в своей транзакции:
// если она падает, версия данных не меняется и запуск прерывается с ошибкой.
//
Процедура ОбновитьДанные() Экспорт

	Текущая = ВерсияДанных();
	Целевая = ЦелеваяВерсияДанных();

	Для Версия = Текущая + 1 По Целевая Цикл
		НачатьТранзакцию();
		Попытка
			ВыполнитьМиграцию(Версия);
			УстановитьЗначениеСостояния(КлючВерсииДанных(), Формат(Версия, "ЧГ="));
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Журнала регистрации на мобильном приложении нет: причина уходит в текст ошибки.
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось обновить данные до версии %1: %2'"), Версия,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Возвращает текущую версию данных; 0 — данные ещё не инициализированы.
//
// Возвращаемое значение:
//  Число
//
Функция ВерсияДанных() Экспорт

	Значение = ЗначениеСостояния(КлючВерсииДанных());
	Если ПустаяСтрока(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Число(Значение);

КонецФункции

// Возвращает значение из регистра СостояниеПриложения.
//
// Параметры:
//  Ключ - Строка
//
// Возвращаемое значение:
//  Строка - пустая строка, если значения нет.
//
Функция ЗначениеСостояния(Ключ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеПриложения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.СостояниеПриложения КАК СостояниеПриложения
	|ГДЕ
	|	СостояниеПриложения.Ключ = &Ключ";
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Версия данных, которую ожидает эта версия конфигурации.
// Увеличивается на 1 вместе с добавлением ветки в ВыполнитьМиграцию.
Функция ЦелеваяВерсияДанных()

	Возврат 1;

КонецФункции

Процедура ВыполнитьМиграцию(Версия)

	Если Версия = 1 Тогда
		НачальноеЗаполнение();
	Иначе
		ВызватьИсключение СтрШаблон("Нет миграции на версию данных %1", Версия);
	КонецЕсли;

КонецПроцедуры

// Версия 1: первый запуск приложения.
Процедура НачальноеЗаполнение()

	Если ПустаяСтрока(Константы.ОсновнаяВалюта.Получить()) Тогда
		Константы.ОсновнаяВалюта.Установить("RUB");
	КонецЕсли;
	Если Константы.ДнейНапоминанияПоУмолчанию.Получить() = 0 Тогда
		Константы.ДнейНапоминанияПоУмолчанию.Установить(3);
	КонецЕсли;
	Если ПустаяСтрока(ЗначениеСостояния("ИдентификаторУстановки")) Тогда
		УстановитьЗначениеСостояния("ИдентификаторУстановки", Строка(Новый УникальныйИдентификатор));
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеСостояния(Ключ, Значение)

	Запись = РегистрыСведений.СостояниеПриложения.СоздатьМенеджерЗаписи();
	Запись.Ключ = Ключ;
	Запись.Значение = Значение;
	Запись.Записать(Истина);

КонецПроцедуры

Функция КлючВерсииДанных()

	Возврат "ВерсияДанных";

КонецФункции

#КонецОбласти
